<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for Fiori Launchpad, which downloads a zip file containing the latest stable version of Fiori Launchpad for macOS.</string>
    <key>Identifier</key>
    <string>corp.sap.maccoe.download.fiorilaunchpad</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Fiori Launchpad</string>
        <key>PACKAGER</key>
        <string>SAPCorp</string>
        <key>VENDOR</key>
        <string>SAP</string>
        <key>SOFTWARETITLE</key>
        <string>Fiori</string>   
        <key>SOFTWARETYPE</key>
         <string>Launchpad</string>     
        <key>DOWNLOAD_URL</key>
        <string>Put_Fiori_Launchpad_download_URL_into_AutoPkg_recipe_override</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
		<dict>
		   <key>Arguments</key>
		   <dict>
		      <key>predicate</key>
		      <string>DOWNLOAD_URL == "Put_Fiori_Launchpad_download_URL_into_AutoPkg_recipe_override"</string>
		   </dict>
		   <key>Processor</key>
		   <string>StopProcessingIf</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%SOFTWARETITLE%%SOFTWARETYPE%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/Applications</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/Applications/Fiori Launchpad.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/Applications/Fiori Launchpad.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "corp.sap.Fiori" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7R5ZEU67FQ")</string>
			</dict>
		</dict>
    </array>
</dict>
</plist>
