<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Uses parent pkg recipe to download the latest AceBIT PasswordDepot for Mac and import it into the JSS.</string>
      <key>Identifier</key>
      <string>corp.sap.maccoe.jss.passworddepot</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>PasswordDepot</string>
         <key>CATEGORY</key>
         <string>Apps</string>
         <key>POLICY_CATEGORY</key>
         <string>Testing</string>
         <key>POLICY_TEMPLATE</key>
         <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
         <key>ICON</key>
         <string>%RECIPE_DIR%/AceBitPasswordDepot.png</string>
         <key>GROUP_TEMPLATE</key>
         <string>%RECIPE_DIR%/SmartGroupTemplate.xml</string>
         <key>GROUP_NAME</key>
         <string>Update-Smart-%NAME%</string>
         <key>DESCRIPTION</key>
         <string>PasswordDepot is a powerful and very user-friendly password manager which helps to organize all of your passwords, credit cards, software licenses and other secrets.</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>ParentRecipe</key>
      <string>corp.sap.maccoe.pkg.passworddepot</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>prod_name</key>
               <string>%NAME%</string>
               <key>category</key>
               <string>%CATEGORY%</string>
               <key>policy_category</key>
               <string>%POLICY_CATEGORY%</string>
               <key>policy_template</key>
               <string>%POLICY_TEMPLATE%</string>
               <key>self_service_icon</key>
               <string>%ICON%</string>
               <key>self_service_description</key>
               <string>%DESCRIPTION%</string>
               <key>groups</key>
               <array>
                  <dict>
                     <key>name</key>
                     <string>%GROUP_NAME%</string>
                     <key>smart</key>
                     <true />
                     <key>template_path</key>
                     <string>%GROUP_TEMPLATE%</string>
                  </dict>
               </array>
            </dict>
            <key>Processor</key>
            <string>JSSImporter</string>
         </dict>
      </array>
   </dict>
</plist>