<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Microsoft's Remote Desktop installer package,renames the package to match our naming standard and imports it into our JSS.</string>
	<key>Identifier</key>
	<string>corp.sap.maccoe.jss.microsoftremotedesktop</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Microsoft</string>
		<key>GROUP_NAME</key>
		<string>Update-Smart-%NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>Microsoft Remote Desktop</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Use Microsoft Remote Desktop app to connect to a remote PC or virtual apps and desktops made available by your administrator.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%RECIPE_DIR%/MicrosoftRemoteDesktop.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>corp.sap.maccoe.pkg.microsoftremotedesktop</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
