<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the current release version of the Mozilla Firefox installer package and renames the installer package to match our naming standard.</string>
      <key>Identifier</key>
      <string>corp.sap.maccoe.pkg.MozillaFirefox</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Firefox</string>
         <key>VENDOR</key>
         <string>Mozilla</string>
         <key>SOFTWARETITLE</key>
         <string>%NAME%</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>ParentRecipe</key>
      <string>com.github.autopkg.download.FirefoxSignedPkg</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
               <key>source_pkg</key>
               <string>%pathname%</string>
               <key>pkg_path</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%_%SOFTWARETITLE%_%version%.pkg</string>
            </dict>
         </dict>
      </array>
   </dict>
</plist>