<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Download recipe for AceBIT PasswordDepot for Mac, which is a password manager.</string>
      <key>Identifier</key>
      <string>corp.sap.maccoe.download.passworddepot</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>PasswordDepot</string>
         <key>VENDOR</key>
         <string>AceBIT</string>
         <key>SOFTWARETITLE</key>
         <string>PasswordDepot</string>
         <key>DOWNLOAD_URL</key>
         <string>Put_PasswordDepot_download_URL_into_AutoPkg_recipe_override</string>
         <key>DOWNLOAD_USERAGENT</key>
         <string>Put_PasswordDepot_download_useragent_into_AutoPkg_recipe_override</string>
         <key>DOWNLOAD_REFERER</key>
         <string>Put_PasswordDepot_download_referer_into_AutoPkg_recipe_override</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>DOWNLOAD_URL == "Put_PasswordDepot_download_URL_into_AutoPkg_recipe_override"</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>DOWNLOAD_USERAGENT == "Put_PasswordDepot_download_useragent_into_AutoPkg_recipe_override"</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>DOWNLOAD_REFERER == "Put_PasswordDepot_download_referer_into_AutoPkg_recipe_override"</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
               <key>url</key>
               <string>%DOWNLOAD_URL%</string>
               <key>request_headers</key>
               <dict>
                  <key>user-agent</key>
                  <string>%DOWNLOAD_USERAGENT%</string>
                  <key>referer</key>
                  <string>%DOWNLOAD_REFERER%</string>
               </dict>
            </dict>
         </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Password Depot*.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "acebit.passworddepot.osx" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = MGH28K9M9F)</string>
            </dict>
        </dict>
         <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
         </dict>
      </array>
   </dict>
</plist>