<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads Camtasia disk image and builds a package.</string>
      <key>Identifier</key>
      <string>corp.sap.maccoe.pkg.TechSmithCamtasia</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Camtasia</string>
         <key>PACKAGER</key>
         <string>SAPCorp</string>
         <key>VENDOR</key>
         <string>Techsmith</string>
         <key>SOFTWARETITLE</key>
         <string>%NAME%</string>
         <key>CAMTASIA_KEY</key>
         <string>Put_Camtasia_Registration_Key_into_AutoPkg_recipe_override</string>
         <key>SIGNINGCERTIFICATE</key>
         <string>Put_Signing_Certificate_into_AutoPkg_recipe_override</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>ParentRecipe</key>
      <string>com.github.autopkg.kernsb.download.TechSmithCamtasia</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>SIGNINGCERTIFICATE == "Put_Signing_Certificate_into_AutoPkg_recipe_override"</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>CAMTASIA_KEY == "Put_Camtasia_Registration_Key_into_AutoPkg_recipe_override"</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>				
         <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
               <key>dmg_path</key>
               <string>%pathname%</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/Postinstall</string>
               <key>pkgdirs</key>
               <dict>
                  <key>Scripts</key>
                  <string>0775</string>
               </dict>
            </dict>
         </dict>
         <dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Postinstall/Scripts/postinstall</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_content</key>
				<string>#!/bin/bash

license_key="%CAMTASIA_KEY%"

if [[ -n "$license_key" ]]; then

   # Create Camtasia license directory if it doesn't exist.

     if [[ ! -d "$3/Users/Shared/TechSmith/Camtasia" ]]; then
      mkdir -p "$3/Users/Shared/TechSmith/Camtasia"
      chmod -R 755 "$3/Users/Shared/TechSmith/Camtasia"
     fi
   
   # Create Camtasia license file if it doesn't exist.
   
     if [[ ! -f "$3/Users/Shared/TechSmith/Camtasia/LicenseKey" ]]; then
      printf "$license_key" > "$3/Users/Shared/TechSmith/Camtasia/LicenseKey"
      chmod 755 "$3/Users/Shared/TechSmith/Camtasia/Camtasia/LicenseKey"
      chmod 777 "$3/Users/Shared/TechSmith/Camtasia"
     fi
fi

exit 0</string>
			</dict>
		</dict>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/%NAME%</string>
               <key>pkgdirs</key>
               <dict>
                  <key>Applications</key>
                  <string>0775</string>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
               <key>source_path</key>
               <string>%pathname%/%app_name%</string>
               <key>destination_path</key>
               <string>%pkgroot%/Applications/%app_name%</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgname</key>
               <string>%PACKAGER%_%VENDOR%_%SOFTWARETITLE%_%version%</string>
               <key>pkg_request</key>
               <dict>
                  <key>pkgdir</key>
                  <string>%RECIPE_CACHE_DIR%</string>
                  <key>id</key>
                  <string>corp.sap.techsmith.camtasia.app.pkg</string>
                  <key>options</key>
                  <string>purge_ds_store</string>
                  <key>scripts</key>
                  <string>%RECIPE_CACHE_DIR%/Postinstall/Scripts</string>
                  <key>chown</key>
                  <array>
                     <dict>
                        <key>path</key>
                        <string>Applications</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>admin</string>
                        <key>mode</key>
                        <string>755</string>
                     </dict>
                  </array>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgSigner</string>
            <key>Arguments</key>
            <dict>
               <key>pkg_path</key>
               <string>%RECIPE_CACHE_DIR%/%PACKAGER%_%VENDOR%_%SOFTWARETITLE%_%version%.pkg</string>
               <key>signing_cert</key>
               <string>%SIGNINGCERTIFICATE%</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
               <key>path_list</key>
               <array>
                  <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                  <string>%RECIPE_CACHE_DIR%/Postinstall</string>
               </array>
            </dict>
         </dict>
      </array>
   </dict>
</plist>