<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Document Center.</string>
	<key>Identifier</key>
	<string>corp.sap.maccoe.download.documentcenter</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
         <string>Document Center</string>
         <key>VENDOR</key>
         <string>SAP</string>
         <key>SOFTWARETITLE</key>
         <string>Document_Center</string>
         <key>APPNAME</key>
         <string>Doc Center</string>
         <key>DOWNLOAD_URL</key>
         <string>Put_DocumentCenter_download_URL_into_AutoPkg_recipe_override</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
		   <key>Arguments</key>
		   <dict>
		      <key>predicate</key>
		      <string>DOWNLOAD_URL == "Put_DocumentCenter_download_URL_into_AutoPkg_recipe_override"</string>
		   </dict>
		   <key>Processor</key>
		   <string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%SOFTWARETITLE%.dmg</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/%APPNAME%.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/%APPNAME%.app</string>
				<key>requirement</key>
				<string>identifier "com.sap.mcm.sdc.client.wrapper" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Q3U792Z354</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
