<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current Apple Enterprise Connect installer, extracts version information and renames the installer package.</string>
	<key>Identifier</key>
	<string>corp.sap.maccoe.pkg.EnterpriseConnect</string>
	<key>Input</key>
	<dict>
        <key>VENDOR</key>
        <string>Apple</string>
        <key>SOFTWARETITLE</key>
        <string>Enterprise_Connect</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.8.0</string>
	<key>ParentRecipe</key>
	<string>corp.sap.maccoe.download.EnterpriseConnect</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unzip</string>
                <key>purge_destination</key>
                <false/>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>FileFinder</string>
        	<key>Arguments</key>
        	<dict>
        		<key>pattern</key>
        		<string>%RECIPE_CACHE_DIR%/unzip/%NAME%*/*.pkg</string>
        	</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%found_filename%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/EnterpriseConnect.pkg/Payload</string>
                <key>extract_root</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
        </dict>            
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/Applications/%NAME%.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>FileFinder</string>
        	<key>Arguments</key>
        	<dict>
        		<key>pattern</key>
        		<string>%RECIPE_CACHE_DIR%/unzip/%NAME%*/*.pkg</string>
        	</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%found_filename%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%VENDOR%_%SOFTWARETITLE%_%version%.pkg</string>
            </dict>
        </dict>
        <dict>
        <key>Arguments</key>
        <dict>
            <key>path_list</key>
            <array>
                <string>%RECIPE_CACHE_DIR%/unzip</string>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </array>
        </dict>
        <key>Processor</key>
        <string>PathDeleter</string>
	</dict>                   	      	
	</array>
</dict>
</plist>
