<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Takes .zip.tar VMware Fusion download and extracts the data</string>
      <key>Identifier</key>
      <string>corp.sap.maccoe.pkg.VMwareFusion</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>VMware Fusion</string>
         <key>PACKAGER</key>
         <string>SAPCorp</string>
         <key>VENDOR</key>
         <string>VMware</string>
         <key>SOFTWARETITLE</key>
         <string>Fusion</string>
         <key>SIGNINGCERTIFICATE</key>
         <string>Put_Signing_Certificate_into_AutoPkg_recipe_override</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>ParentRecipe</key>
      <string>com.justinrummel.download.VMwareFusion</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>SIGNINGCERTIFICATE == "Put_Signing_Certificate_into_AutoPkg_recipe_override"</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
               <key>archive_path</key>
               <string>%pathname%</string>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/tar</string>
               <key>purge_destination</key>
               <true />
               <key>archive_format</key>
               <string>tar</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
               <key>archive_path</key>
               <string>%RECIPE_CACHE_DIR%/tar/com.vmware.fusion.zip</string>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/source</string>
               <key>purge_destination</key>
               <true />
               <key>archive_format</key>
               <string>zip</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
               <key>input_path</key>
               <string>%RECIPE_CACHE_DIR%/source/payload/%NAME%.app</string>
               <key>requirement</key>
               <string>identifier "com.vmware.fusion" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EG7KH642X6</string>
            </dict>
         </dict>
         <dict>
            <key>Comment</key>
            <string>Extract a version string from Info.plist to use for the package.</string>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
               <key>input_plist_path</key>
               <string>%RECIPE_CACHE_DIR%/source/payload/%NAME%.app/Contents/Info.plist</string>
               <key>plist_version_key</key>
               <string>CFBundleShortVersionString</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/%NAME%</string>
               <key>pkgdirs</key>
               <dict>
                  <key>Applications</key>
                  <string>0755</string>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
               <key>source_path</key>
               <string>%RECIPE_CACHE_DIR%/source/payload/%NAME%.app</string>
               <key>destination_path</key>
               <string>%pkgroot%/Applications/%NAME%.app</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgname</key>
               <string>%PACKAGER%_%VENDOR%_%SOFTWARETITLE%_%version%</string>
               <key>pkg_request</key>
               <dict>
                  <key>pkgdir</key>
                  <string>%RECIPE_CACHE_DIR%</string>
                  <key>id</key>
                  <string>com.vmware.fusion</string>
                  <key>options</key>
                  <string>purge_ds_store</string>
                  <key>chown</key>
                  <array>
                     <dict>
                        <key>path</key>
                        <string>Applications</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                     </dict>
                  </array>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgSigner</string>
            <key>Arguments</key>
            <dict>
               <key>pkg_path</key>
               <string>%RECIPE_CACHE_DIR%/%PACKAGER%_%VENDOR%_%SOFTWARETITLE%_%version%.pkg</string>
               <key>signing_cert</key>
               <string>%SIGNINGCERTIFICATE%</string>
            </dict>
         </dict>
      </array>
   </dict>
</plist>